[Survived] Block
Bureau/tp-jest-master/src/interval.js:8:2
     }
 
     toString() 
-	{
-        return "[" + this.start + "," + this.end + "]";
-    }
+	{}
 	
     /**

[Survived] BinaryExpression
Bureau/tp-jest-master/src/interval.js:9:16
 
     toString() 
 	{
-        return "[" + this.start + "," + this.end + "]";
+        return "[" + this.start - "," + this.end + "]";
     }
 	

[Survived] BinaryExpression
Bureau/tp-jest-master/src/interval.js:9:16
 
     toString() 
 	{
-        return "[" + this.start + "," + this.end + "]";
+        return "[" - this.start + "," + this.end + "]";
     }
 	

[Killed] Block
Bureau/tp-jest-master/src/interval.js:47:5
      * @returns {boolean}
      */
     includes(interval)
-    {
-        return this.end >= interval.end && this.start <= interval.start;
-    };
+    {};
 
     /**

[Killed] BinaryExpression
Bureau/tp-jest-master/src/interval.js:48:44
      */
     includes(interval)
     {
-        return this.end >= interval.end && this.start <= interval.start;
+        return this.end >= interval.end && this.start > interval.start;
     };
 

[Killed] ConditionalExpression
Bureau/tp-jest-master/src/interval.js:48:16
      */
     includes(interval)
     {
-        return this.end >= interval.end && this.start <= interval.start;
+        return true;
     };
 

[Killed] Block
Bureau/tp-jest-master/src/interval.js:68:5
      * @returns {Interval[]}
      */
     union(interval)
-    {
-        return [Math.min(this.start,interval.start),Math.max(this.end,interval.end)];
-    };
+    {};
 
     /**
