[Killed] IfStatement
Bureau/tp-jest-master/src/math.js:27:9
  * @returns {boolean}
  */
 Util.isPrime = function (n) {
-    if (n === 1 || n === 0) {
+    if (false) {
         return false;
     }

[Killed] ConditionalExpression
Bureau/tp-jest-master/src/math.js:27:9
  * @returns {boolean}
  */
 Util.isPrime = function (n) {
-    if (n === 1 || n === 0) {
+    if (false || n === 0) {
         return false;
     }

[Killed] StringLiteral
Bureau/tp-jest-master/src/math.js:31:15
         return false;
     }
     if (n < 0) {
-        throw 'Unable to compute prime for n < 0'
+        throw ""
     }
     for (var i = 2; i < n; i++)

[Killed] IfStatement
Bureau/tp-jest-master/src/math.js:34:13
         throw 'Unable to compute prime for n < 0'
     }
     for (var i = 2; i < n; i++)
-        if (n % i === 0) return false;
+        if (false) return false;
     return true;
 

[Killed] Block
Bureau/tp-jest-master/src/math.js:50:1
  * @returns {number}
  */
 Util.sumPrime = function(n)
-{
-    if(Util.isPrime(n))
-    {
-        if(n<2)
-        {
-          return 0;
-        } else
-        return n+Util.sumPrime(n-1);
-    }
-      else
-    {
-        if(n<2)
-        {
-            return 0;
-        } 
-		else return Util.sumPrime(n-1);
-    }
-};
+{};
 
 /**

[Killed] IfStatement
Bureau/tp-jest-master/src/math.js:51:8
  */
 Util.sumPrime = function(n)
 {
-    if(Util.isPrime(n))
+    if(true)
     {
         if(n<2)

[Killed] IfStatement
Bureau/tp-jest-master/src/math.js:51:8
  */
 Util.sumPrime = function(n)
 {
-    if(Util.isPrime(n))
+    if(false)
     {
         if(n<2)

[Killed] Block
Bureau/tp-jest-master/src/math.js:52:5
 Util.sumPrime = function(n)
 {
     if(Util.isPrime(n))
-    {
-        if(n<2)
-        {
-          return 0;
-        } else
-        return n+Util.sumPrime(n-1);
-    }
+    {}
       else
     {

[Killed] IfStatement
Bureau/tp-jest-master/src/math.js:53:12
 {
     if(Util.isPrime(n))
     {
-        if(n<2)
+        if(true)
         {
           return 0;

[Killed] BinaryExpression
Bureau/tp-jest-master/src/math.js:53:12
 {
     if(Util.isPrime(n))
     {
-        if(n<2)
+        if(n <= 2)
         {
           return 0;

[Survived] Block
Bureau/tp-jest-master/src/math.js:54:9
     if(Util.isPrime(n))
     {
         if(n<2)
-        {
-          return 0;
-        } else
+        {} else
         return n+Util.sumPrime(n-1);
     }

[Killed] BinaryExpression
Bureau/tp-jest-master/src/math.js:57:16
         {
           return 0;
         } else
-        return n+Util.sumPrime(n-1);
+        return n - Util.sumPrime(n - 1);
     }
       else

[Killed] BinaryExpression
Bureau/tp-jest-master/src/math.js:57:32
         {
           return 0;
         } else
-        return n+Util.sumPrime(n-1);
+        return n+Util.sumPrime(n + 1);
     }
       else

[Killed] Block
Bureau/tp-jest-master/src/math.js:60:5
         return n+Util.sumPrime(n-1);
     }
       else
-    {
-        if(n<2)
-        {
-            return 0;
-        } 
-		else return Util.sumPrime(n-1);
-    }
+    {}
 };
 

[Killed] IfStatement
Bureau/tp-jest-master/src/math.js:61:12
     }
       else
     {
-        if(n<2)
+        if(false)
         {
             return 0;

[Killed] Block
Bureau/tp-jest-master/src/math.js:62:9
       else
     {
         if(n<2)
-        {
-            return 0;
-        } 
+        {} 
 		else return Util.sumPrime(n-1);
     }

[Killed] BinaryExpression
Bureau/tp-jest-master/src/math.js:65:29
         {
             return 0;
         } 
-		else return Util.sumPrime(n-1);
+		else return Util.sumPrime(n + 1);
     }
 };

[Killed] Block
Bureau/tp-jest-master/src/math.js:82:1
  * @returns {array}
  */
 Util.fizzBuzz = function(n)
-{
-  var arrayFizz=Array();
-    while(n>0)
-    {
-        if((n % 3)==0 && (n % 5)==0)
-			{
-				arrayFizz.push("FizzBuzz")
-			}
-		else if((n % 3)==0)
-			{
-				arrayFizz.push("Fizz");
-			}
-		else if((n % 5)==0)
-			{
-				arrayFizz.push("Buzz");
-			}
-		else arrayFizz.push(n);
-		n--;
-    }
-    return arrayFizz;
-};
+{};
 
 /**

[Killed] WhileStatement
Bureau/tp-jest-master/src/math.js:84:11
 Util.fizzBuzz = function(n)
 {
   var arrayFizz=Array();
-    while(n>0)
+    while(false)
     {
         if((n % 3)==0 && (n % 5)==0)

[Killed] BinaryExpression
Bureau/tp-jest-master/src/math.js:84:11
 Util.fizzBuzz = function(n)
 {
   var arrayFizz=Array();
-    while(n>0)
+    while(n <= 0)
     {
         if((n % 3)==0 && (n % 5)==0)

[Timeout] Block
Bureau/tp-jest-master/src/math.js:85:5
 {
   var arrayFizz=Array();
     while(n>0)
-    {
-        if((n % 3)==0 && (n % 5)==0)
-			{
-				arrayFizz.push("FizzBuzz")
-			}
-		else if((n % 3)==0)
-			{
-				arrayFizz.push("Fizz");
-			}
-		else if((n % 5)==0)
-			{
-				arrayFizz.push("Buzz");
-			}
-		else arrayFizz.push(n);
-		n--;
-    }
+    {}
     return arrayFizz;
 };

[Killed] BinaryExpression
Bureau/tp-jest-master/src/math.js:86:26
   var arrayFizz=Array();
     while(n>0)
     {
-        if((n % 3)==0 && (n % 5)==0)
+        if((n % 3)==0 && n % 5 != 0)
 			{
 				arrayFizz.push("FizzBuzz")

[Killed] IfStatement
Bureau/tp-jest-master/src/math.js:86:12
   var arrayFizz=Array();
     while(n>0)
     {
-        if((n % 3)==0 && (n % 5)==0)
+        if(true)
 			{
 				arrayFizz.push("FizzBuzz")

[Survived] Block
Bureau/tp-jest-master/src/math.js:87:4
     while(n>0)
     {
         if((n % 3)==0 && (n % 5)==0)
-			{
-				arrayFizz.push("FizzBuzz")
-			}
+			{}
 		else if((n % 3)==0)
 			{

[Survived] StringLiteral
Bureau/tp-jest-master/src/math.js:88:20
     {
         if((n % 3)==0 && (n % 5)==0)
 			{
-				arrayFizz.push("FizzBuzz")
+				arrayFizz.push("")
 			}
 		else if((n % 3)==0)

[Killed] IfStatement
Bureau/tp-jest-master/src/math.js:90:11
 			{
 				arrayFizz.push("FizzBuzz")
 			}
-		else if((n % 3)==0)
+		else if(false)
 			{
 				arrayFizz.push("Fizz");

[Killed] BinaryExpression
Bureau/tp-jest-master/src/math.js:90:12
 			{
 				arrayFizz.push("FizzBuzz")
 			}
-		else if((n % 3)==0)
+		else if((n * 3)==0)
 			{
 				arrayFizz.push("Fizz");

[Killed] Block
Bureau/tp-jest-master/src/math.js:91:4
 				arrayFizz.push("FizzBuzz")
 			}
 		else if((n % 3)==0)
-			{
-				arrayFizz.push("Fizz");
-			}
+			{}
 		else if((n % 5)==0)
 			{

[Killed] BinaryExpression
Bureau/tp-jest-master/src/math.js:94:11
 			{
 				arrayFizz.push("Fizz");
 			}
-		else if((n % 5)==0)
+		else if(n % 5 != 0)
 			{
 				arrayFizz.push("Buzz");

[Killed] BinaryExpression
Bureau/tp-jest-master/src/math.js:94:12
 			{
 				arrayFizz.push("Fizz");
 			}
-		else if((n % 5)==0)
+		else if((n * 5)==0)
 			{
 				arrayFizz.push("Buzz");

[Killed] Block
Bureau/tp-jest-master/src/math.js:95:4
 				arrayFizz.push("Fizz");
 			}
 		else if((n % 5)==0)
-			{
-				arrayFizz.push("Buzz");
-			}
+			{}
 		else arrayFizz.push(n);
 		n--;

[Killed] StringLiteral
Bureau/tp-jest-master/src/math.js:96:20
 			}
 		else if((n % 5)==0)
 			{
-				arrayFizz.push("Buzz");
+				arrayFizz.push("");
 			}
 		else arrayFizz.push(n);

[Timeout] PostfixUnaryExpression
Bureau/tp-jest-master/src/math.js:99:3
 				arrayFizz.push("Buzz");
 			}
 		else arrayFizz.push(n);
-		n--;
+		n++;
     }
     return arrayFizz;

[Killed] Block
Bureau/tp-jest-master/src/math.js:114:1
  * @returns {string}
  */
 Util.cipher = function (phrase)
-{
-    var maPhraseChar=phrase.split('');
-    var resultat="";
-    maPhraseChar.forEach(function(c)
-    {
-      var char=c.charCodeAt(0);
-        if(char==90)
-        {
-            char=64;
-        }
-        if(char==122)
-        {
-          char=96;
-        }
-          resultat+=String.fromCharCode(char+1);
-      }
-    );
-    return resultat;
-};
+{};
 
 module.exports = Util;

[Killed] Block
Bureau/tp-jest-master/src/math.js:118:5
     var maPhraseChar=phrase.split('');
     var resultat="";
     maPhraseChar.forEach(function(c)
-    {
-      var char=c.charCodeAt(0);
-        if(char==90)
-        {
-            char=64;
-        }
-        if(char==122)
-        {
-          char=96;
-        }
-          resultat+=String.fromCharCode(char+1);
-      }
+    {}
     );
     return resultat;

[Killed] IfStatement
Bureau/tp-jest-master/src/math.js:120:12
     maPhraseChar.forEach(function(c)
     {
       var char=c.charCodeAt(0);
-        if(char==90)
+        if(false)
         {
             char=64;

[Killed] BinaryExpression
Bureau/tp-jest-master/src/math.js:120:12
     maPhraseChar.forEach(function(c)
     {
       var char=c.charCodeAt(0);
-        if(char==90)
+        if(char != 90)
         {
             char=64;

[Killed] Block
Bureau/tp-jest-master/src/math.js:121:9
     {
       var char=c.charCodeAt(0);
         if(char==90)
-        {
-            char=64;
-        }
+        {}
         if(char==122)
         {

[Killed] IfStatement
Bureau/tp-jest-master/src/math.js:124:12
         {
             char=64;
         }
-        if(char==122)
+        if(true)
         {
           char=96;

[Killed] BinaryExpression
Bureau/tp-jest-master/src/math.js:124:12
         {
             char=64;
         }
-        if(char==122)
+        if(char != 122)
         {
           char=96;

[Survived] Block
Bureau/tp-jest-master/src/math.js:125:9
             char=64;
         }
         if(char==122)
-        {
-          char=96;
-        }
+        {}
           resultat+=String.fromCharCode(char+1);
       }

[Killed] BinaryExpression
Bureau/tp-jest-master/src/math.js:128:41
         {
           char=96;
         }
-          resultat+=String.fromCharCode(char+1);
+          resultat+=String.fromCharCode(char - 1);
       }
     );
